{"course": [{"description": "This course provides a general introduction to computer programming. The main focus is on programming skills and how to apply these skills in solving a variety of problems. Procedural programming concepts are stressed.", "code": "CSCI 1105", "name": "Intro to Computer Programming", "creditHours": "CREDIT HOURS: 3"}, {"description": "A hands-on course on technologies and the underlying infrastructure for social computing, including digital collaboration media, social networks and visualization, and their social impact. Students will use various applications, such as Twitter, YouTube, and wikis to examine their functionalities, and explore infrastructure technologies including databases, computer networks and Web-servers that facilitate their execution.", "code": "CSCI 1107", "name": "Social Computing", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course will provide students with a practical overview of the world of data science research. Through hands-on use of Python’s data science libraries and publicly open datasets students will be exposed to the research methods and cutting-edge analyses used to effectively manipulate, process and investigate data from diverse disciplines.", "code": "CSCI 1109", "name": "Practical Data Science", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course provides a general introduction to computer science and the hardware and software of computers. The main focus is on programming skills and how to apply these skills in solving a variety of problems. Algorithmic concepts, linear data structures are emphasized.", "code": "CSCI 1110", "name": "Intro to Computer Science", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course introduces some key concepts in computer systems. Students will learn fundamental systems concepts and apply them to explain how the hardware and software environment affects program behaviour. Topics include data and program representation, program translation, operating systems, software engineering, and networking.", "code": "CSCI 1120", "name": "Intro to Computer Systems", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course introduces students to key web concepts and skills for designing, implementing, and maintaining web content. Topics include introduction to the Web, UI and UX best practices, hypertext markup languages such as HTML, style sheets, client side programming, multimedia foundations, dynamic content and web content organization and maintenance.", "code": "CSCI 1170", "name": "Intro to Web Design & Devel.", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course is an introduction to calculus with a focus on applications to computer science. Students will be exposed to examples from graphics, machine learning, robotics, simulation, and other areas of computer science. Topics covered will include single variable limits, derivatives, integrals, differential equations, and Fourier series.", "code": "CSCI 1300", "name": "Calculus in Computer Science", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course is an introduction to formal reasoning and discrete mathematics with applications to computer science. Students will be introduced to formal notation and reasoning about problems and algorithms. Topics include: sets, sequences, and summations, simple proof techniques, elementary number theory, back-of-the-envelope approximations, combinatorial objects. Applications and relevance of these concepts in computer science will be emphasized.", "code": "CSCI 1315", "name": "Discrete Math for CS", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course introduces students to the history of computing from early mechanical devices to the internet. Students will learn to read, write, and discuss scholarly arguments about how computing has shaped society, and how society has shaped computing, over time.", "code": "CSCI 1800", "name": "Computing & Society in History", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course lays the foundations for academic success in computer science studies via development of academic literacies and language skills. In this seminar-style course, students develop the ability to use academic English flexibly, in spoken and written modes, according to the norms of the language practices in computer science studies.", "code": "CSCI 1900", "name": "Acad Found for CS Studies", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course helps students communicate effectively and with confidence in a variety of workplace settings. Students learn to understand their audience and to deliver accurate, effective messages. Written assignments and oral presentations allow for the development of these skills through practice.", "code": "CSCI 2100", "name": "Workplace Comm for CS", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course provides a comprehensive introduction to data structures and algorithms, including their design, analysis, and implementation. In discussing design and analysis there is a strong emphasis on abstraction. In discussing implementation, general approaches that are applicable in a wide range of procedural programming language are emphasized, in addition to a focus on the details of implementations. Topics include an introduction to asymptotic analysis and a review of basic data structures (stacks, queues, lists, vectors), trees, priority queues, dictionaries, hashing, search trees, sorting (MergeSort, QuickSort, RadixSort) and sets, and graphs (traversals, spanning trees, shortest paths).", "code": "CSCI 2110", "name": "Data Structures & Algorithms", "creditHours": "CREDIT HOURS: 3"}, {"description": "See the course description for", "code": "CSCI 2112", "name": "Discrete Structures I", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course presents tools, techniques, and concepts for systems programming. Students will be exposed to assembly and will be introduced to the C programming language. The course also discusses memory hierarchies, performance measurement, exception control flow, and performance related issues. Students will be involved in significant amount of low-level programming.", "code": "CSCI 2122", "name": "Systems Programming", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course presents techniques and methodologies for software development with modern tools. It introduces students to the software development life cycle and best practices for source code management, testing, debugging, and building. Particular focus will be on building individual skills in the development and testing phases of the life cycle. Students will be expected to work with existing medium-size code-bases that are implemented in different programming languages. Students will be exposed to a variety of software tools and will be expected to use them throughout the course.", "code": "CSCI 2134", "name": "Software Development", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course introduces students to the concepts of database management systems and database design. Topics include: Database (DB) components, DB design using entity-relationship  (relational and object oriented), SQL, and transactional properties and techniques to support them. The concepts will be reinforced using one or more Database Management Systems.", "code": "CSCI 2141", "name": "Intro to Database Systems", "creditHours": "CREDIT HOURS: 3"}, {"description": "A server side scripting language is used to create web pages with dynamic content.  The course provides the technology necessary for connecting client web pages to web servers and processing and storing information obtained using forms during web sessions.", "code": "CSCI 2170", "name": "Intro to Server Side Scripting", "creditHours": "CREDIT HOURS: 3"}, {"description": "Information security is becoming increasingly important in today's networked world, and is impacting every aspect of our lives including finance, healthcare, government, education, arts and entertainment.  The objective of this course is to teach the basic principles of information security from the perspective of providing security awareness and its best practices for the real world.  Topics include motivation for security, tools and techniques used by adversaries to gather information and launch attacks, Internet security, firewalls, basics of encryption and authentication, virus protection, secure credit card and bank transactions, wireless security, computer forensics, identify theft and protection, anti-phishing and biometric security.", "code": "CSCI 2201", "name": "Introduction to Info Security", "creditHours": "CREDIT HOURS: 3"}, {"description": "This is an introductory, project based, programming course for science majors. The course focuses on programming techniques useful for students in their scientific pursuits. The course introduces basic programming in Python and then goes on to guide students through using simulations, modelling and data-driven analysis. Examples and projects will be taken primarily from the fields of biology, genetics, neuroscience, psychology, earth sciences, chemistry among others.", "code": "CSCI 2202", "name": "Intro to Programming w/ applic", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students learn how software projects are planned, implemented, and closed. Topics include plan development, project life cycles, software development life cycles, measurable organizational value, work breakdown structures, scheduling, scope, risk, change requests, conflict resolution, closure, and post-mortems.", "code": "CSCI 2690", "name": "Intro to Software Projects", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students take junior roles in project teams to solve a real-world information technology problem. Team members are drawn from all years of study. The project gives students an opportunity to develop their technical, management, and professional skills.", "code": "CSCI 2691", "name": "Introductory Project", "creditHours": "CREDIT HOURS: 3"}, {"description": "Computers can enable people to do things that our present laws and policies were not formulated to cover (hacking, sharing files on the internet, and companies sharing data). In such cases, people need to be able to decide for themselves the best course of action, and defend such decisions. This course aims at developing the ethical reasoning skills and sensitivities that computer professionals will need to make good decisions and to justify them. The course includes a general introduction to ethical theories and their use in making and justifying decisions. We then consider various issues and case studies, illustrating the kinds of problems that can arise from the use and misuse of computers and technology: the responsibilities of computing professionals; ethics on the internet (hacking, computer crime, netiquette); privacy and information; intellectual property; social and political issues (digital divide, computers and work, the internet as a democratic technology).", "code": "CSCI 3101", "name": "Soc/Ethi/Prof Issues in Csci", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course covers techniques for the design and analysis of efficient algorithms and data structures. Topics include asymptotic analysis, divide and conquer algorithms, greedy algorithms, dynamic programming, data structure design, optimization algorithms, and amortized analysis. The techniques are applied to problems such as sorting, searching, identifying graph structure, and manipulating sets.", "code": "CSCI 3110", "name": "Dsgn. & Anal. of Algorithms I.", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course includes a review of I/O and interrupt structures. Topics covered include dynamic procedure activation, system structure and evaluation, memory management, process management, process scheduling, recovery procedures, concurrency, deadlocks, resource allocation, protection, and operating systems implementation.", "code": "CSCI 3120", "name": "Operating Systems", "creditHours": "CREDIT HOURS: 3"}, {"description": "The course examines the process of software development, from initial planning through implementation and maintenance. A brief survey of available tools and techniques will be presented covering the topics of analysis, planning, estimating, project management, design, testing, and evaluation. Particular emphasis will be given to organizing and planning, team participation and management, top-down design and structure charts, system and information flow diagrams, walk-throughs and peer review, and testing and quality control.", "code": "CSCI 3130", "name": "Software Engineering", "creditHours": "CREDIT HOURS: 3"}, {"description": "The course provides an introduction to the main steps of a typical data science project, using the R language and environment as the illustration tool. The course addresses the theoretical foundations of several key methods and techniques used in data science projects, from data importation and manipulation, going through data visualization and model building, to\nreporting and deployment. The course is targeted to students without a strong technical background on programming or computer science tools. The theoretical concepts are motivated and introduced through practical case studies with the help of the R environment.", "code": "CSCI 3141", "name": "Foundations/Data Science", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course deals with concepts and techniques underlying the design of interactive systems. Both human factors and the technical methods of user interface design are covered. Students will learn how to apply various techniques through the design, creation, and testing of a prototype system.", "code": "CSCI 3160", "name": "Designing User Interfaces", "creditHours": "CREDIT HOURS: 3"}, {"description": "The course provides students with a practical foundation in high-level computer animation programming. Through the development of a significant project using industry standard graphics libraries, students will learn proven techniques that have become common currency in the field of computer animation.", "code": "CSCI 3161", "name": "Intro Comp Graph & Animation", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course gives students a foundation in computer networks. It presents a top-down view of the layered architectural elements of communication systems, focusing on the Internet and TCP/IP. Topics include client/server systems, packet switching, protocol stacks, queuing theory, application protocols, socket programming, remote service calls, reliable transport, UDP, TCP, and security.", "code": "CSCI 3171", "name": "Network Computing", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course provides a solid grasp of core WWW technologies and a conceptual framework for understanding the development of the WWW and working with future web technologies. The course explores interactive and non-interactive web applications built using various technologies and architectural models. We explore the significance of web design and programming concepts in terms of accessibility issues both from the perspective of web robots and end-users. Web caching, proxy techniques, and security issues are also discussed.", "code": "CSCI 3172", "name": "Web-Centric Computing", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students perform design and development roles in project teams to solve a real-world information technology problem. Team members are drawn from all years of study.  The project gives students an opportunity to develop their design, technical, management, and professional skills.", "code": "CSCI 3691", "name": "Intermediate Project", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course covers the (i) application of standard abstract data types, fundamental data structures, and commonly used algorithms; (ii) design and implementation of databases; and (iii) the fundamental practice of software engineering. Students reinforce the skills and concepts covered in lectures through assignments and a project that integrates all three components.", "code": "CSCI 3901", "name": "Software Development Concepts", "creditHours": "CREDIT HOURS: 6"}, {"description": "This course covers advanced techniques for the design and analysis of efficient algorithms. Problems are taken from a wide range of areas including combinatorics, numerical computation, graph algorithms, string matching, approximation algorithms, computational geometry, and NP-Completeness.", "code": "CSCI 4113", "name": "Dsgn. & Anal. of Algorithms II", "creditHours": "CREDIT HOURS: 3"}, {"description": "The advent of low-cost storage and processing power coupled with ever increasing amounts of \"born digital\" data has created the new field of data science. The ability to achieve a specific goal or answer a business question by crunching through very large and complex databases is becoming a competitive advantage for businesses and leads to new discoveries in science and medicine. This course is an overview of the different processes that make up a data science project. While other fields concentrate on finding previously unknown knowledge or searchingfor a specific pattern, data science focuses on answering deep questions and making the conclusions accessible to the rest of the organization. This course requires the implementation of software and experimental design in order to complete the assignments.", "code": "CSCI 4146", "name": "Process of Data Science", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course focuses on the theory of learning machines, which are important techniques underlying data mining and many AI applications. The topics include supervised learning, in particular maximum likelihood estimation in stochastic model and probabilistic reasoning, ubiquitous learning machines such as support vector machines and deep neural networks; unsupervised learning which includes generative models, expectation maximization, and Boltzmann machines; and reinforcement learning including Markov decision processes and temporal difference learning. The course includes an introduction to a high level modeling language such as MATLAB or Python and refresher on probability theory and matrix algebra.", "code": "CSCI 4155", "name": "Machine Learning", "creditHours": "CREDIT HOURS: 3"}, {"description": "Human-computer interaction deals with human-computer communication and how to facilitate it. This course begins with a discussion of information processing characteristics important to human-computer interaction and formal models of human-computer interaction. Subsequent topics include dialogue techniques, response times and display rates, information presentation, interaction devices, computer training, help systems, computer supported co-operative work, information search and visualization, hypermedia, and the world wide web.", "code": "CSCI 4163", "name": "Human-Computer Interaction", "creditHours": "CREDIT HOURS: 3"}, {"description": "The primary objective of this course is to give the student a comprehensive understanding and specialized knowledge in the field of computer networks and communications. The course teaches through a systems approach to networks by examining the hardware and protocol components that comprise a network. The course also examines the interactions and interdependencies between protocols. Topics covered in this course include network principles and concepts, transmission principles, network architecture, routers and routing protocols, direct link networks, wireless networks, internetworking, and emerging network technologies.", "code": "CSCI 4171", "name": "Networks and Communications", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course covers the principles of mobile computing and the concepts and techniques underlying the design and development of mobile computing applications. Mobile computing is discussed from technological, application, and user perspectives. Topics include mobile and wireless communication technologies, development environments, application design for resource limited and failure-prone environments, user interface issues in the mobile computing setting, and the future of mobile computing.", "code": "CSCI 4176", "name": "Mobile Computing", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course is a study of specific academic subject area not covered in another course offered at Dalhousie University, under close supervision of a faculty member. It typically consists of predetermined readings, discussions with the instructor, and a term paper summarizing the studied material. A specific directed studies course must be approved by the undergraduate chair in consultation with the instructor.", "code": "CSCI 4192", "name": "Directed Studies", "creditHours": "CREDIT HOURS: 3"}, {"description": "The Technology Innovation combines elements of design thinking, rapid prototyping, and software development that can be used to validate ideas that could yield new technologies and new business models. Over the semester students will work in interdisciplinary teams to address a Design Challenge posed by industry. The ideas advanced by teams will reflect the powerful synergies that exist between software development, design thinking and entrepreneurship.", "code": "CSCI 4193", "name": "Technology Innovation", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students take a leadership role in project teams to solve a real-world information technology problem. Team members are drawn from all years of study. The project gives students an opportunity to develop their leadership, management, and professional skills.", "code": "CSCI 4691", "name": "Advanced Project", "creditHours": "CREDIT HOURS: 3"}, {"description": "In this course, we will focus on creating the appropriate document or presentation in a variety of situations. Emphasis will be on reducing/removing noise (anything that distracts from the message) and on increasing/adding relevance (things that reinforce understanding of the message).", "code": "CSCI 5100", "name": "Communication Skills", "creditHours": "CREDIT HOURS: 3"}, {"description": "Technology Innovation combines elements of design thinking, rapid prototyping, and software development that can be used to validate ideas that could yield new technologies and new business models. The students work in interdisciplinary teams to address a Design Challenge posed by industry. The ideas advanced by teams will reflect the powerful synergies that exist between software development, design thinking and entrepreneurship.", "code": "CSCI 5193", "name": "Technology Innovation", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course will provide students with the fundamentals of producing high quality code in a team-based programming environment. The concepts covered in class will be implemented during the group project. After establishing the coding environment using Agile methodology; efficiently automating builds, deployment, and configuration; and integrating source control, students will learn to write clean, readable code using S.O.L.I.D principles, the proper use of cohesion and coupling, and design patterns. Other topics include establishing data, business logic and display logic boundaries; error handling and logging; refactoring; and test-driven development.", "code": "CSCI 5308", "name": "Adv Topics in Software Develop", "creditHours": "CREDIT HOURS: 3"}, {"description": "In this course, we will focus on three pillars for managingand analyzing data in distributed and cloud environments: Management of data in distributed systems, Data Warehousing, and Data Analytics.", "code": "CSCI 5408", "name": "Data Mgmt, Warhsng Analytics", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course covers the principles of mobile computing and the concepts and techniques underlying the design and development of mobile computing applications. Mobile computing is discussed from technological, application, and user perspectives. Topics include mobile and wireless communication technologies, development environments, applications design for resource limited and failure-prone environments, user interface issues in the mobile computing setting, and the future of mobile computing.", "code": "CSCI 5708", "name": "Mobile Computing", "creditHours": "CREDIT HOURS: 3"}, {"description": "", "code": "CSCI 5902", "name": "Special Topics in Appl Com Sci", "creditHours": "CREDIT HOURS: 3"}, {"description": "This research oriented course covers advanced material in the design and analysis of algorithms. It combines mathematically rigorous coverage of traditional topics with recent research results. Problems are taken from a wide range of areas including combinatorics, numerical computation, graph algorithms, string matching, approximation algorithms, computational geometry, NP-completeness.", "code": "CSCI 6101", "name": "Adv Topics Analysis Algorithms", "creditHours": "CREDIT HOURS: 3"}, {"description": "Machine Learning is the area of Artificial Intelligence concerned with the problem of building computer programs that automatically improve with experience. The intent of this course is to present a broad introduction to the principles and paradigms underlying machine learning, including discussions of each of the major approaches currently being investigated. Main topics covered in the course include a review of information theory, unsupervised learning or clustering (the K-means family, co-clustering, mixture models and the EM algorithm), supervised learning or classification (support vector machines, decision trees, rule learning, Bayesian learners, maximum entropy, ensemble methods), feature selection and feature transformations. The focus of applications that will be discussed will be text classification and clustering.", "code": "CSCI 6505", "name": "Machine Learning", "creditHours": "CREDIT HOURS: 3"}, {"description": "In this course, we will focus on Big Data and the Pillars of that emerging discipline: machine learnig/data mining, elements of high-performance computing, and data visualization. Significant part of the course will be devoted to selected, efficient methods for building models from large datasets data using machine learning techniques.", "code": "CSCI 6515", "name": "Machine learning for Big Data", "creditHours": "CREDIT HOURS: 3"}, {"description": "Human-Computer interaction (HCI) deals with facilitating human-computer communication. Students will learn the foundations of HCI, including the process for user-centered development, the models that inform HCI design, the social issues influencing HCI design and use, and the evaluation of interfaces and systems with users.", "code": "CSCI 6610", "name": "Human Computer Interaction", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course will introduce the concepts of Visual Analytics (VA). VA is a multi-disciplinary domain that combines data visualization with machine learning and other automated techniques to help people make sense of data. Students will be introduced to the design of visual representations supporting tasks to go from findings to insights based on data. Topics include basic concepts of information visualization and machine learning; visual analytics of evolving phenomena; analysis of spatial and temporal data  sets; visual social media analytics; and the visual analytics of text and multimedia collections.\n\nStudents will prototype visual analytics applications using existing toolkits, coupling machine learning and visualization methods. Students will gain competence in performing data analysis and visualization tasks in different application domains.", "code": "CSCI 6612", "name": "Visual Analytics", "creditHours": "CREDIT HOURS: 3"}, {"description": "The primary focus of this course is to provide a comprehensive coverage of emerging and emergent network technologies that lay the foundation for the design of next generation high-performance global internetworks. Topics covered include advanced TCP/IP design, ATM protocols, Gigabit Ethernets, IPv6 networks and protocols, Secure Networks and VPNs, Wireless Networks, Optical Networks, and Internetwork Architecture Case Studies.", "code": "CSCI 6704", "name": "Adv Topics Computer Networks", "creditHours": "CREDIT HOURS: 3"}, {"description": "The distributed enterprise information system consisting of workstations, servers, bridges, routers, hubs, Internet and interactive Web technology is critical to corporate productivity. This course explores how Information Technology (IT) can be used to manage an enterprise. It further examines how managers can strategically use IT to capture and deliver knowledge more efficiently and to create a competitive advantage.", "code": "CSCI 6706", "name": "Network Design and Management", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course offers the student the opportunity to undertake further study into a specific topic of interest that is not covered in the regular course offerings. The student will be supervised by a faculty member competent in the area of interest. Regular meetings between the student and supervising faculty will be held. A substantial project and report are required.", "code": "CSCI 6901", "name": "Directed Studies", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course offers the doctoral student the opportunity to undertakefurther study into a specific topic of interest that is not covered in the regular course offerings. The student will be supervised by a faculty member competent in the area of interest. Regular meetings between the student and supervising faculty will be held. A substantial project and report are required.", "code": "CSCI 6902", "name": "Doctoral Directed Studies", "creditHours": "CREDIT HOURS: 3"}, {"description": "A research seminar course, to introduce Computer Science graduate students to thesis-based programs to contemporary research topics and projects, through regular attendance of the Faculty of Computer Science Research Seminar Series.  Speakers include both Dalhousie Computer Science researchers and visiting speakers from other institutions.", "code": "CSCI 6999", "name": "Research Sem Computer Science", "creditHours": "CREDIT HOURS: 0"}, {"description": "The course provides the students in the Master of Applied Computer Science program with an opportunity to conduct a research project under the supervision of a faculty member. Regular meetings between the student and the supervising faculty will be held. A project report and open presentation are required.", "code": "CSCI 7001", "name": "Research Proj in Comp Science", "creditHours": "CREDIT HOURS: 6"}, {"description": "This course provides doctoral students with an opportunity to conduct a research project under the supervision of a faculty member leading to the research aptitude examination. Regular meetings between the student and the supervising faculty will be held. A project report and oral defense to a committee are required.", "code": "CSCI 7900", "name": "Directed Research Project", "creditHours": "CREDIT HOURS: 6"}, {"description": "This course is the first work term for students in the Co-operative Education Program. Pass/fail grading applies to this course.", "code": "CSCI 8781", "name": "Co-op Work Term", "creditHours": "CREDIT HOURS: 0"}, {"description": "This course is the second work term for students in the Co-operative Education Program. Pass/fail grading applies to this course.", "code": "CSCI 8782", "name": "Co-op Work Term 2", "creditHours": "CREDIT HOURS: 0"}, {"description": "This course is the third work term for students in the Co-operative Education Program. Pass/fail grading applies to this course.", "code": "CSCI 8783", "name": "Co-op Work Term 3", "creditHours": "CREDIT HOURS: 0"}, {"description": "This course is the first work term academic component for students in the Co-operative Education Program.", "code": "CSCI 8791", "name": "Co-op I", "creditHours": "CREDIT HOURS: 1"}, {"description": "This course is the second work term academic component for students in the Co-operative Education Program.", "code": "CSCI 8792", "name": "Co-op II", "creditHours": "CREDIT HOURS: 1"}, {"description": "This course is the third work term academic component for students in the Co-operative Education Program.", "code": "CSCI 8793", "name": "Co-op III", "creditHours": "CREDIT HOURS: 1"}, {"description": "This is a course through which students complete their Honours Thesis requirements. Honours students in Computer Science must register for this course or CSCI 8871/72. In this course, students complete their thesis research, write their honours theses, and give public presentations of their work. In a normal course sequence, the student should have taken", "code": "CSCI 8873", "name": "Honours Seminar", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students carry out research and related activities under the supervision of a faculty member.  Work done in this course is intended to prepare and contribute to the research to be done when the students enters the Master of Computer Science program.  This is a PASS/FAIL course.", "code": "CSCI 8874", "name": "Research Project 1", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students carry out research and related activities under the supervision of a faculty member.  Work done in this course is intended to prepare and contribute to the research to be done when the students enters the Master of Computer Science program.  This is a PASS/FAIL course.", "code": "CSCI 8875", "name": "Research Project 2", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students in the Bachelor of Computer Science Co-operative Education Program must register for this course, which orients students to the co-op system. Pass/fail grading applies to this course.", "code": "CSCI 8890", "name": "Co-op Seminar", "creditHours": "CREDIT HOURS: 0"}, {"description": "", "code": "CSCI 9000", "name": "Master's Thesis", "creditHours": "CREDIT HOURS: 0"}, {"description": "", "code": "CSCI 9100", "name": "Industrial Internship", "creditHours": "CREDIT HOURS: 3"}, {"description": "", "code": "CSCI 9200", "name": "Entrepreneurial Internship", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students carry out research and related activities under the supervision of a faculty member.  Work done in this course is intended to prepare and contribute to the research project that is part of the requirements of the Master of Applied Computer Science (MACS) program.", "code": "CSCI 9301", "name": "Research Project 1", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students carry out research and related activities under the supervision of a faculty member.  Work done in this course is intended to prepare and contribute to the research project that is part of the requirements of the Master of Applied Computer Science (MACS) program.", "code": "CSCI 9302", "name": "Research Project 2", "creditHours": "CREDIT HOURS: 3"}, {"description": "", "code": "CSCI 9530", "name": "Doctoral Thesis", "creditHours": "CREDIT HOURS: 0"}, {"description": "This course is designed to provide graduate students with the tools required to find an internship and be successful, whilst developing vital professional competencies.  Aspects of career planning and development, self-assessment, resume and cover letter writing, interviewing skills, and job search techniques will be introduced.  Students will also be provided with an overview of all relevant co-op program policies and procedures.  This course should be completed two terms prior to the first work term.  The grade will be Pass/Fail.", "code": "CSCI 9890", "name": "Internship Preparation", "creditHours": "CREDIT HOURS: 0"}]}