{"course": [{"description": "This course provides a general introduction to computer programming. The main focus is on programming skills and how to apply these skills in solving a variety of problems. Procedural programming concepts are stressed.", "code": "CSCI 1105", "name": "Intro to Computer Programming", "creditHours": "CREDIT HOURS: 3"}, {"description": "A hands-on course on technologies and the underlying infrastructure for social computing, including digital collaboration media, social networks and visualization, and their social impact. Students will use various applications, such as Twitter, YouTube, and wikis to examine their functionalities, and explore infrastructure technologies including databases, computer networks and Web-servers that facilitate their execution.", "code": "CSCI 1107", "name": "Social Computing", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course will provide students with a practical overview of the world of data science research. Through hands-on use of Python’s data science libraries and publicly open datasets students will be exposed to the research methods and cutting-edge analyses used to effectively manipulate, process and investigate data from diverse disciplines.", "code": "CSCI 1109", "name": "Practical Data Science", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course provides a general introduction to computer science and the hardware and software of computers. The main focus is on programming skills and how to apply these skills in solving a variety of problems. Algorithmic concepts, linear data structures are emphasized.", "code": "CSCI 1110", "name": "Intro to Computer Science", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course introduces some key concepts in computer systems. Students will learn fundamental systems concepts and apply them to explain how the hardware and software environment affects program behaviour. Topics include data and program representation, program translation, operating systems, software engineering, and networking.", "code": "CSCI 1120", "name": "Intro to Computer Systems", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course introduces students to key web concepts and skills for designing, implementing, and maintaining web content. Topics include introduction to the Web, UI and UX best practices, hypertext markup languages such as HTML, style sheets, client side programming, multimedia foundations, dynamic content and web content organization and maintenance.", "code": "CSCI 1170", "name": "Intro to Web Design & Devel.", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course is an introduction to calculus with a focus on applications to computer science. Students will be exposed to examples from graphics, machine learning, robotics, simulation, and other areas of computer science. Topics covered will include single variable limits, derivatives, integrals, differential equations, and Fourier series.", "code": "CSCI 1300", "name": "Calculus in Computer Science", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course is an introduction to formal reasoning and discrete mathematics with applications to computer science. Students will be introduced to formal notation and reasoning about problems and algorithms. Topics include: sets, sequences, and summations, simple proof techniques, elementary number theory, back-of-the-envelope approximations, combinatorial objects. Applications and relevance of these concepts in computer science will be emphasized.", "code": "CSCI 1315", "name": "Discrete Math for CS", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course introduces students to the history of computing from early mechanical devices to the internet. Students will learn to read, write, and discuss scholarly arguments about how computing has shaped society, and how society has shaped computing, over time.", "code": "CSCI 1800", "name": "Computing & Society in History", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course lays the foundations for academic success in computer science studies via development of academic literacies and language skills. In this seminar-style course, students develop the ability to use academic English flexibly, in spoken and written modes, according to the norms of the language practices in computer science studies.", "code": "CSCI 1900", "name": "Acad Found for CS Studies", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course helps students communicate effectively and with confidence in a variety of workplace settings. Students learn to understand their audience and to deliver accurate, effective messages. Written assignments and oral presentations allow for the development of these skills through practice.", "code": "CSCI 2100", "name": "Workplace Comm for CS", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course provides a comprehensive introduction to data structures and algorithms, including their design, analysis, and implementation. In discussing design and analysis there is a strong emphasis on abstraction. In discussing implementation, general approaches that are applicable in a wide range of procedural programming language are emphasized, in addition to a focus on the details of implementations. Topics include an introduction to asymptotic analysis and a review of basic data structures (stacks, queues, lists, vectors), trees, priority queues, dictionaries, hashing, search trees, sorting (MergeSort, QuickSort, RadixSort) and sets, and graphs (traversals, spanning trees, shortest paths).", "code": "CSCI 2110", "name": "Data Structures & Algorithms", "creditHours": "CREDIT HOURS: 3"}, {"description": "See the course description for", "code": "CSCI 2112", "name": "Discrete Structures I", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course presents tools, techniques, and concepts for systems programming. Students will be exposed to assembly and will be introduced to the C programming language. The course also discusses memory hierarchies, performance measurement, exception control flow, and performance related issues. Students will be involved in significant amount of low-level programming.", "code": "CSCI 2122", "name": "Systems Programming", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course presents techniques and methodologies for software development with modern tools. It introduces students to the software development life cycle and best practices for source code management, testing, debugging, and building. Particular focus will be on building individual skills in the development and testing phases of the life cycle. Students will be expected to work with existing medium-size code-bases that are implemented in different programming languages. Students will be exposed to a variety of software tools and will be expected to use them throughout the course.", "code": "CSCI 2134", "name": "Software Development", "creditHours": "CREDIT HOURS: 3"}, {"description": "This course introduces students to the concepts of database management systems and database design. Topics include: Database (DB) components, DB design using entity-relationship  (relational and object oriented), SQL, and transactional properties and techniques to support them. The concepts will be reinforced using one or more Database Management Systems.", "code": "CSCI 2141", "name": "Intro to Database Systems", "creditHours": "CREDIT HOURS: 3"}, {"description": "A server side scripting language is used to create web pages with dynamic content.  The course provides the technology necessary for connecting client web pages to web servers and processing and storing information obtained using forms during web sessions.", "code": "CSCI 2170", "name": "Intro to Server Side Scripting", "creditHours": "CREDIT HOURS: 3"}, {"description": "Information security is becoming increasingly important in today's networked world, and is impacting every aspect of our lives including finance, healthcare, government, education, arts and entertainment.  The objective of this course is to teach the basic principles of information security from the perspective of providing security awareness and its best practices for the real world.  Topics include motivation for security, tools and techniques used by adversaries to gather information and launch attacks, Internet security, firewalls, basics of encryption and authentication, virus protection, secure credit card and bank transactions, wireless security, computer forensics, identify theft and protection, anti-phishing and biometric security.", "code": "CSCI 2201", "name": "Introduction to Info Security", "creditHours": "CREDIT HOURS: 3"}, {"description": "This is an introductory, project based, programming course for science majors. The course focuses on programming techniques useful for students in their scientific pursuits. The course introduces basic programming in Python and then goes on to guide students through using simulations, modelling and data-driven analysis. Examples and projects will be taken primarily from the fields of biology, genetics, neuroscience, psychology, earth sciences, chemistry among others.", "code": "CSCI 2202", "name": "Intro to Programming w/ applic", "creditHours": "CREDIT HOURS: 3"}, {"description": "Students learn how software projects are planned, implemented, and closed. Topics include plan development, project life cycles, software development life cycles, measurable organizational value, work breakdown structures, scheduling, scope, risk, change requests, conflict resolution, closure, and post-mortems.", "code": "CSCI 2690", "name": "Intro to Software Projects", "creditHours": "CREDIT HOURS: 3"}]}